---
type: ACADExportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 13
tags: [revit-api, class]
---

# ACADExportOptions

`Autodesk.Revit.DB.ACADExportOptions` · Revit 2024 · 13 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | ACAPreference | — | `public ACAObjectPreference ACAPreference { get ; set ; }` |
| Property | ExportOfSolids | — | `public SolidGeometry ExportOfSolids { get ; set ; }` |
| Property | ExportingAreas | — | `public bool ExportingAreas { get ; set ; }` |
| Property | FileVersion | — | `public ACADVersion FileVersion { get ; set ; }` |
| Property | HatchBackgroundColor | 2018 | `public Color HatchBackgroundColor { get ; set ; }` |
| Property | LineScaling | — | `public LineScaling LineScaling { get ; set ; }` |
| Property | LinetypesFileName | — | `public string LinetypesFileName { get ; set ; }` |
| Property | MarkNonplotLayers | — | `public bool MarkNonplotLayers { get ; set ; }` |
| Property | NonplotSuffix | — | `public string NonplotSuffix { get ; set ; }` |
| Property | SharedCoords | — | `public bool SharedCoords { get ; set ; }` |
| Property | TargetUnit | — | `public ExportUnit TargetUnit { get ; set ; }` |
| Property | TextTreatment | — | `public TextTreatment TextTreatment { get ; set ; }` |
| Property | UseHatchBackgroundColor | 2018 | `public bool UseHatchBackgroundColor { get ; set ; }` |